Repository: ppiserchia/CelestiaT
Catalog: Localizable.xcstrings
Source language: en
Languages: es, it

source: Activism
es: Activismo
it: Attivismo

source: At first I didn't realize how bad my dysphoria was affecting me on a personal level and the relationships I’d had. After I realized I was trans I started to change a lot of things slowly. I learned to change my vocal range and talk more feminine and started growing out my hair. Some days my dysphoria is worse than others, but doing small things like growing my hair has been helping me a lot. Even practicing makeup!
es: Al principio no me daba cuenta de lo mucho que me estaba afectando mi disforia a nivel personal y las relaciones que había tenido. Cuando me di cuenta de que era trans, empecé a cambiar muchas cosas poco a poco. Aprendí a cambiar mi registro vocal y a hablar de forma más femenina y empecé a dejarme crecer el pelo. Algunos días mi disforia es peor que otros, pero hacer pequeñas cosas como dejarme crecer el pelo me ha ayudado mucho. Incluso practicar el maquillaje!
it: All’inizio non mi rendevo conto di quanto la mia disforia mi stesse influenzando a livello personale e nelle relazioni che avevo. Dopo che ho realizzato di essere trans ho iniziato a cambiare piano piano molte cose. Ho imparato a cambiare la mia voce e a parlare in maniera più femminile e ho iniziato a farmi crescere i capelli. Alcuni giorni la mia disforia è peggio degli altri, ma fare piccole cose come lasciarmi crescere i capelli mi ha aiutato molto. Persino fare pratica col makeup!

source: Body Dysmorphia
es: Dismorfia Corporal
it: Dismorfia Corporea

source: Clubbing
es: Salir de Fiesta
it: Vita in discoteca

source: Clubbing is supposed to be fun for everyone, still as a trans person it can and it has been tricky for me, for many years. I'm a very energic and bubbly kind of guy and so I've been wanting to club since my teen years but I wasn't always confident enough to just go and have fun. When you're not comfortable in your own skin it's incredibly hard to just go and dance pressed against that many strangers. Fear and dysphoria have stopped me from enjoying the night life for way too much either because I felt like I could not pass as a man, or that I couldn't wear club clothes that made me feel confident. Nowadays, no matter how much it took me, I'm grateful I can enjoy my youth the way I want to, dress the way I want and not fear being outed or hurt in any way when I go out clubbing. I still rather go to a queer club because I feel safer and at home, but it's a huge accomplishment for me, at this point in my transition, to be enjoying every sort of night club and know that my identity is not in danger nor ridiculed. I can just be me and live the moment.
es: Se supone que las discotecas son divertidas para todo el mundo, pero para mí, como persona trans, puede serlo y lo ha sido durante muchos años. Soy un tipo muy enérgico y amigable, así que he querido ir a discotecas desde mi adolescencia, pero no siempre he tenido la confianza suficiente para ir y divertirme. Cuando no te sientes cómodo en tu propia piel, es increíblemente difícil ir y bailar apretado contra tantos desconocidos. El miedo y la disforia me han impedido disfrutar de la vida nocturna durante demasiado tiempo porque sentía que no podía pasar por un hombre o porque no podía llevar ropa de discoteca que me hiciera sentir segura de mí misma. Hoy en día, por mucho que me haya costado, estoy agradecido de poder disfrutar de mi juventud como quiero, vestir como quiero y no temer que me descubran o me hagan daño de ninguna manera cuando salgo de fiesta. Sigo prefiriendo ir a una discoteca queer porque me siento más seguro y en casa, pero es un gran logro para mí, en este momento de mi transición, disfrutar de todo tipo de discotecas y saber que mi identidad no corre peligro ni es ridiculizada. Puedo ser yo mismo y vivir el momento.
it: La vita in discoteca dovrebbe essere divertente per tutti, tuttavia come persona trans può essere ed è stato difficile per me, per molti anni. Sono un ragazzo molto energetico e frizzante ed è per questo che ho sempre voluto andare in discoteca fin dall’adolescenza ma non mi sentivo abbastanza sicuro di me di andarci e divertirmi. Quando non ti senti sicuro di te nella propria pelle è incredibilmente difficile andare semplicemente e ballare circondati da tanti estranei. Paura e disforia mi hanno fermato dal godermi la vita notturna per molto tempo sia perché mi sentivo come se non potessi entrare come un uomo, o che non potessi indossare vestiti da discoteca che mi facessero sentire sicuro di me. Oggigiorno, per quanto mi ci è voluto, sono grato di potermi godere la mia giovinezza nel modo in cui io voglio, vestendomi nel modo in cui voglio senza aver paura di essere scoperto o ferito in alcun modo quando vado in discoteca. Preferisco andare ad una discoteca queer perché mi sento più sicuro e a casa, ma è un grande risultato per me, a questo punto della mia transizione, godermi ogni tipo di discoteca notturna e sapere che la mia identità non è né a rischio né ridicolizzata. Posso essere me stesso e godermi il momento.

source: Coming Out
es: Salir del Closet

source: Community
es: Comunidad
it: Comunità

source: Dysphoria
es: Disforia
it: Disforia

source: Education
es: Educación
it: Istruzione

source: Explore constellations
es: Explora constelaciones
it: Esplora le costellazioni

source: Family
es: Familia
it: Famiglia

source: For me coming out is BIG topic for me, it’s one of this thing that feels sometimes wrong to do, because you will never know how people are going to react, maybe they not even care but for me at least , I feel like that , i feel exposed almost, it’s like if i put a big sign over my head with light on, maybe it’s just anxiety that’s talking but in general i talk about my sexuality ,experience etc with people I feel that are not going to judge or People that are curious about this kind of topic. But it’s again coming out it’s not a big of deal I come out to my mother and she accept me and I’m happy! Sometimes it can be hard and sometimes it’s the most liberating thing you can do with yourself.
es: Para mí salir del armario es un tema GRANDE, es una de esas cosas que a veces me parece mal hacer, porque nunca sabes cómo va a reaccionar la gente, quizá ni siquiera les importe, pero al menos yo me siento así, casi expuestx, es como si me pusiera un gran cartel sobre mi cabeza con una luz encendida, quizá sea sólo mi ansiedad la que habla, pero en general hablo de mi sexualidad, experiencia, etc. con gente que creo que no va a juzgarme o con gente que siente curiosidad por este tipo de temas. Pero, de nuevo, salir del closet no es un gran problema. Yo salí del closet con mi madre y ella me aceptó, ¡y soy feliz! A veces puede ser duro y a veces es lo más liberador que puedes hacer contigo mismx.
it: Per me fare coming out è un GRANDE argomento per me, è una delle cose che sembra qualcosa di sbagliato da fare, perché non saprai mai come le persone reagiranno, magari non gliene frega niente ma per me almeno, sento, mi sento quasi espostx, è quasi se mettessi un grande cartello in testa, può essere solo la mia ansia che sta parlando ma in generale io parlo sulla mia sessualità, esperienza etc con persone che io sento non vadano a giudicare o persone che sono curiose di questo argomento. Ma ancora una volta coming out non è un problema ho fatto coming out con mia madre e lei mi ha accettato e io sono felice! Alcune volte può essere difficile e alcune volte è la cosa più liberatoria che puoi fare con te stesso.

source: For me in media there is still work to do in representation, but we are in a good Start , especially in cartoons! And I’m so happy that the new generations can grow up maybe with a better representation not only for the LGBTQIA’s+ , but also the black community and everyone that feel not represented enough in their life. Good example of this is Craig of the Creek! A beautiful cartoon with a different cast of characters, with beautiful visual and story! Also each one of the characters is important and their identity don’t feel force or too much weird, it feels natural, and should be like this in every media that we consume , that’s not weird to see this kind of representation, it should be normal.
es: Para mí, en los medios de comunicación aún queda trabajo por hacer en cuanto a representación, pero estamos en un buen comienzo, especialmente en las caricaturas!. Estoy muy contentx de que las nuevas generaciones puedan crecer con una mejor representación no sólo de los LGBTQIA+, sino también de la comunidad negra y de todxs aquellxs que no se sienten suficientemente representadxs en sus vidas. Un buen ejemplo de ello es Craig of the Creek. Un hermoso dibujo animado con un elenco diferente de personajes, con una hermosa historia visual. Además, cada uno de los personajes es importante y su identidad no se siente forzada o demasiado extraña, se siente natural, y debería ser así en todos los medios que consumimos, que no es raro ver este tipo de representación, debería ser normal.
it: Per me in mezzi di comunicazione c’è ancora del lavoro da fare nella rappresentazione, ma siamo in un buon inizio , specialmente in cartoni animati! E sono molto felice che le nuove generazioni possono crescere forse con una rappresentazione migliore non solo per la LGBTQIA+, ma anche per la comunità nera e per tutti coloro non si sentono rappresentati abbastanza nella loro vita. Un buon esempio di ciò è Craig of the Creek! Un bellissimo cartone animato con un variegato cast di personaggi, con una bella visuale e una bella storia! Inoltre ognuno dei personaggi è importante e la loro identità non sembra forzata o troppo strana, ma naturale, e dovrebbe essere così in ogni mezzo di comunicazione che consumiamo, non è strano vedere questo tipo di rappresentazione, dovrebbe essere normale.

source: Friends
es: Amigxs
it: Amici

source: Gender dysphoria has been very difficult for me, so it's been hard not to run into a hospital and ask for everything to be done asap. However I think I need to let my mind slowly adapt to myselt and my body. I'm definitely planning on getting everything done that I need/want! But in due time.
es: La disforia de género ha sido muy difícil para mí, por lo que ha sido difícil no correr a un hospital y pedir que todo se haga lo antes posible. Sin embargo, creo que tengo que dejar que mi mente se adapte poco a poco a mí y a mi cuerpo. ¡Definitivamente estoy planeando que me hagan todo lo que necesito/quiero! Pero a su debido tiempo.
it: La disforia di genere è stata molto difficile per me, quindi è stato difficile non correre in un ospedale e

source: Gender Euphoria
es: Euforia de Género
it: Euforia Di Genere

source: Gender Identity
es: Identidad de Género
it: Identità Di Genere

source: HTR
es: THS
it: Terapia Ormonale

source: I am the youngest between two brothers. My mom was very strict with me, and at first she didn't accept the fact that I was transitioning. My father didn't agree with my mom, and helped me not only morally standing for me and saying "If I loved you as a girl, I will love you also as a boy, because you're my child", but also financially. In the first years of transitioning, my mother didn't call me with my actual name, and that caused more and more problems in terms of the relationship I had with her. Now, after some time and disputes, my mother understood and she accepts me as I am. I forgive her for what she did in the past, for being so strict with me, and now we have a stabler relationship.
es: Soy el menor de dos hermanos. Mi madre era muy estricta conmigo, y al principio no aceptaba el hecho de que estuviera en transición. Mi padre no estaba de acuerdo con mi madre, y me ayudó no sólo moralmente apoyándome y diciendo "Si te quise como niña, te querré también como niño, porque eres mi hijo", sino también económicamente. En los primeros años de transición, mi madre no me llamaba por mi nombre real, y eso causaba cada vez más problemas en la relación que tenía con ella. Ahora, después de tiempo y disputas, mi madre lo ha entendido y me acepta tal como soy. La perdono por lo que hizo en el pasado, por ser tan estricta conmigo, y ahora tenemos una relación más estable.
it: Sono il più piccolo tra due fratelli. Mia mamma era molto severa con me, e all’inizio non accettava il fatto che stessi facendo la transizione. Mio padre non era d’accordo con mia mamma, e mi ha aiutato non solo moralmente, sostenendomi e dicendomi “Se ti ho amato come ragazza, ti amerò anche come ragazzo, perché tu sei mio figlio”, ma anche economicamente. Nei primi anni di transizione, mia mamma non mi chiamava con il mio nome attuale, e questo ha causato sempre più problemi nel rapporto che avevo con lei. Ora, dopo un po’ di tempo e litigi, mia mamma ha capito e mi accetta per quello che sono. Io l’ho perdonata per quello che ha fatto nel passato, per essere così severa con me, ed ora abbiamo una rapporto più stabile.

source: I began the process 4 years ago, but changing my ID wasn't that simple. Bureaucratically speaking, the process itself wasn't easy, especially when the court of Salerno 2 years ago "lost" all the papers related to me, so I had to choose whether waiting for the bureaucracy to do the process, or paying a lawyer to help loose the process a little bit and at least, have my documents updated. I decided the second choice, paying over 5.000€, with my father's financial help. Also, I had some bureaucracy issues in enrolling at the University, just because I couldn't change my documents in a very short time.
es: Empecé el proceso hace 4 años, pero cambiar mi DNI no fue tan sencillo. Burocráticamente hablando, el proceso en sí no fue fácil, sobre todo cuando el tribunal de Salerno hace 2 años "perdió" todos los papeles relacionados conmigo, así que tuve que elegir entre esperar a que la burocracia hiciera el proceso, o pagar a un abogado para ayudar a perder el proceso un poco y, al menos, tener mis documentos actualizados. Decidí la segunda opción, pagando más de 5.000 euros, con la ayuda financiera de mi padre. Además, tuve algunos problemas burocráticos a la hora de matricularme en la universidad, simplemente porque no pude cambiar mis documentos en muy poco tiempo.
it: Ho iniziato il processo 4 anni fa, ma cambiare i miei documenti non è stato così semplice. Burocraticamente parlando, il processo in sé non è stato semplice, specialmente quando la corte di Salerno 2 anni fa perse tutti i documenti che mi riguardavano, quindi dovevo scegliere se aspettare che la burocrazia facesse il suo percorso, o se pagare un avvocato che mi aiutasse a snellire un po’ il processo e almeno, ad avere i miei documenti aggiornati. Ho optato per la seconda scelta, pagando oltre 5.000€ con l’aiuto finanziario di mio padre. Inoltre, ho avuto qualche problema finanziario nell’iscrivermi all’università, solo perché non potevo cambiare i miei documenti in poco tempo.

source: I first discovered I was trans after meeting another trans person that explained how she and her -also trans- husband had found out. And it aligned a lot with the issues I'd felt with my own body, mind and feelings. Coming out is always hard, it feels like your entire world is about to crumble. You get some pretty nasty fears and thoughts at the start. For me those really disappeared when my family and girlfriend said they loved me no matter what and would support me in what I wish to do.
es: Descubrí que era trans después de conocer a otra persona trans que me explicó cómo ella y su marido, también trans, lo habían descubierto. Y coincidía mucho con los problemas que yo había sentido con mi propio cuerpo, mente y sentimientos. Salir del closet siempre es duro, parece que todo tu mundo está a punto de desmoronarse. Al principio tienes miedos y pensamientos bastante desagradables. En mi caso, desaparecieron cuando mi familia y mi novia me dijeron que me querían pasara lo que pasara y que me apoyarían en lo que quisiera hacer.
it: Ho scoperto per la prima volta di essere una persona trans dopo aver incontrato un’altra persona trans che mi ha spiegato come lei e suo marito - anche lui trans - lo avevamo scoperto. E questo coincideva molto con i problemi che io provavo con il mio proprio corpo, la mia propria mente e i miei propri sentimenti. Fare Coming Out è sempre difficile, ci si sente come se il mondo intero stesse per crollare. All’inizio si provano paure e pensieri molto brutti. Per me essi sono scomparsi quando la mia famiglia e la mia ragazza mi hanno detto che mi amavano a prescindere e che mi avrebbero sostenuto in ciò che volevo fare.

source: I haven't yet started HRT because of the issues I'm scared I might face with my current medical issues, but I definitely want to start. However I’ve been slowly coming out to first my girlfriend and then family and friends anyway.
es: Todavía no he empezado con la THS por miedo a los problemas que podría tener con mis problemas médicos actuales, pero definitivamente quiero empezar. Sin embargo, he ido saliendo del armario poco a poco, primero con mi novia y luego con mi familia y amigos.
it: Non ho ancora iniziato la terapia ormonale sostitutiva a causa dei problemi che ho paura di dover affrontare con la mia attuale situazione medica, ma voglio assolutamente iniziare. Tuttavia ho fatto lentamente coming out con la mia prima ragazza e poi con la famiglia e gli amici.

source: I think we have amazing and inclusive groups! Like r/trans or r/asktrans, to help cis people understand and talk to people without being scared of making us uncomfortable or worried that we could take what they say as a statement rather than genuine curiosity. I'm personally not very active in those spaces and I feel that's been the best thing for me.
es: Creo que tenemos grupos increíbles e inclusivos! Como r/trans o r/asktrans, para ayudar a la gente cis a entender y hablar con la gente sin tener miedo de hacernos sentir incómodos o preocupados de que podamos tomar lo que dicen como una declaración en lugar de genuina curiosidad. Personalmente no soy muy activa en esos espacios y siento que eso ha sido lo mejor para mí.
it: Io penso che abbiamo gruppi fantastici ed inclusivi! Come r/trans oppure r/asktrans, per aiutare le persone cis a capire e parlare con le persone senza aver paura di metterci a disagio o temere che possiamo prendere quello che dicono come un’affermazione piuttosto che una genuina curiosità. Personalmente non sono molto attivə in questi spazi e credo che è stata la miglior cosa per me.

source: ID Change
es: Cambio de ID
it: Cambio dei documenti

source: it’s a big topic for me also because it’s a bit funny , I still don’t know how do I feel about myself , I know that I’m not cis person, but I don’t know exactly how to define myself I don’t want to be label in something and I’m fine with it! I only like the term “non binary” for my gender identity because is the closest thing that feels what I’m going trough right now, I’m not confused or anything it’s just hard to define myself especially for my sexuality. People also when I tell this they usually label me as Gay or lesbian and everything you can imagine , but I just want to be me and that’s good enough ( i don’t know if it’s cringe sorry in advance)
es: Es un gran tema para mi también porque es un poco curioso, todavía no se como me siento sobre mi mismx, se que no soy una persona cis, pero no se exactamente como definirme, no quiero ser etiquetadx en algo y estoy bien con eso. Sólo me gusta el término «no binario» para mi identidad de género porque es lo más parecido a lo que estoy viviendo ahora mismo, no estoy confundidx ni nada de eso, sólo que es difícil definirme, especialmente en lo que se refiere a mi sexualidad. La gente también cuando digo esto por lo general me etiquetan como Gay o lesbiana y todo lo que te puedas imaginar, pero yo sólo quiero ser yo y eso es lo suficientemente bueno.
it: È un grande argomento per me perché è un po’ divertente , non so ancora cosa provo su me stesso , so che non sono una persona cis, ma non so esattamente come definirmi non voglio essere etichettato in qualcosa e mi va bene così! Mi piace solo il termine “non binary” per la mia identità di genere perché è la cosa che più si avvicina a ciò che sto vivendo proprio ora, non sono confuso o altro è solo difficile definirmi specialmente per la mia sessualità. La gente anche quando parlo di questo mi etichettano come Gay o lesbica e tutto ciò che puoi immaginare, ma io voglio solo essere me e questo basta ( non so se è cringe scusate in anticipo)

source: Just as you are.
es: Así como eres tú.
it: così come lo sei tu.

source: Love Life
es: Vida Amorosa
it: Vita Amorosa

source: Media Representation
es: Representación mediática
it: Rappresentazione multimediale

source: My love life at first suffered very heavily. I’d been in a one year relationship at the time where she'd gotten so used to seeing me as something else. And suddenly it gets flipped on its head. The whole dynamic started to shift and it took a lot of time and communication to figure it out between me and her. However, now we are in a situationship and she's my biggest supporter.
es: Mi vida amorosa al principio sufrió mucho. Llevaba un año de relación y ella se había acostumbrado a verme como otra cosa. Y de repente se dio la vuelta. Toda la dinámica empezó a cambiar y costó mucho tiempo y comunicación resolverlo entre ella y yo. Sin embargo, ahora estamos en una situación de pareja y ella es mi mayor apoyo.
it: Inizialmente la mia vita amorosa ha sofferto molto. All’epoca avevo una relazione di un anno in cui lei si era abituata a vedermi come un’altra persona. E all’improvviso la situazione si è capovolta. L’intera dinamica ha iniziato a cambiare e ci è voluto molto tempo e della comunicazione per capirla tra me e lei. Comunque, ora siamo in una situazione di coppia e lei è la mia più grande sostenitrice.

source: Religion
es: Religión
it: Religione

source: Sexuality
es: Sexualidad
it: Sesso

source: Shopping
es: Compras

source: Start
es: Empieza
it: Inizia

source: Surgery
es: Cirugía
it: Operazione

source: Therapy
es: Terapia
it: Terapia

source: They are made up of unique stories
es: Están compuestas de historias únicas
it: create da storie uniche

source: Trans Community
es: Comunidad Trans
it: Comunità Trans

source: Whenever you want,
es: Cuándo quieras,
it: Quando vuoi,

source: wherever you want.
es: dónde quieras.
it: dove vuoi.

source: Work
es: Trabajo
it: Lavoro

source: Your safe space
es: Tu espacio seguro
it: Il tuo spazio sicuro
